In [49]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime

In [53]:
dates = pd.read_csv('ENA_TimeStamp.csv', header=None, names=['YYYYMMDD', 'start', 'end'])
print(dates)

      YYYYMMDD     start       end
0     20090721  00:00:00  00:39:59
1     20090721  00:59:59  01:40:00
2     20090721  02:00:00  02:20:00
3     20090721  02:40:00  02:40:00
4     20090721  03:00:00  03:39:59
...        ...       ...       ...
3797  20170929  13:19:59  13:30:00
3798  20170929  20:06:00  20:20:00
3799  20170929  20:40:00  20:40:00
3800  20171107  04:58:59  06:30:00
3801  20171107  06:59:59  08:20:00

[3802 rows x 3 columns]

In [54]:
dates['start'] = pd.to_datetime(dates.YYYYMMDD.astype(str)+' '+dates.start.astype(str), format='%Y%m%d %H:%M:%S')
dates['end'] = pd.to_datetime(dates.YYYYMMDD.astype(str)+' '+dates.end.astype(str), format='%Y%m%d %H:%M:%S')
dates.drop('YYYYMMDD', inplace=True, axis=1)

In [66]:
ott = pd.read_feather('../data/supermag/OTT_prepared.feather')

In [67]:
# ott.set_index('Date_UTC', inplace=True)
ott

           MLAT    MLT      dBHt   direction            Date_UTC
0         56.33  18.89       NaN         NaN 1995-01-01 00:00:00
1         56.33  18.91  0.000000    0.000000 1995-01-01 00:01:00
2         56.33  18.93  0.100000  180.000000 1995-01-01 00:02:00
3         56.33  18.94  0.000000    0.000000 1995-01-01 00:03:00
4         56.33  18.96  0.100000   90.000000 1995-01-01 00:04:00
...         ...    ...       ...         ...                 ...
13148635  54.98  18.86  0.100000    0.000000 2019-12-31 23:55:00
13148636  54.98  18.88  0.223607 -116.565051 2019-12-31 23:56:00
13148637  54.98  18.89  0.100000  -90.000000 2019-12-31 23:57:00
13148638  54.98  18.91  0.200000    0.000000 2019-12-31 23:58:00
13148639  54.98  18.93  0.100000    0.000000 2019-12-31 23:59:00

[13148640 rows x 5 columns]